models/Product.php

INSERT INTO `shop_product` (`cateid`, `title`, `descr`, `price`, `ishot`, `issale`, `saleprice`, `num`, `istui`, `cover`, `pics`) VALUES ('1', 'test', '和', '15', '1', '0', '13', '1', '1', 'oxy8j4wog.bkt.clouddn.com/59e5a4cedbf3a', '{\"59e5a4cf2ce83\":\"oxy8j4wog.bkt.clouddn.com\\/59e5a4cf2ce83\"}')
---
    public function add($data)
    {
      //  print_r($data);die;
        if ($this->load($data) && $this->save()) {